# Preambule

In [4]:
import pandas as pd
import numpy as np
from datetime import datetime,timedelta
import calendar

## Import and Cleanning Data

In [86]:
def f_employ(x): # function to import and clean data
    df=pd.read_excel(x,sheet_name='employés')
    #date=[];ddates=[]
    def col_names(df): # look for the number of line with the names of the banks to be columns names
        y=[];z=[];
        for i in range(0,(df.shape[0]-1)):
            if 'BNC' in df.loc[i:(i+1),:].values:
                y=df.loc[i:(i+1),:].values.tolist()[0]
                z=i+1
                #break
        # add Date as name of column with the dates
        df.columns=['Date']+y[1:]#df_employ.columns[1:].tolist()
        df=df.iloc[z:,:]
        return df
    df=col_names(df)

    # remove columns where names are NaN
    jj=[ type(i)!=float for i in df.columns.values]
    df=df[df.columns.values[jj]]
    # remove all rows where there is at least 10 NaN
    df=df.dropna(axis=0,thresh=10)
    
    date=[];ddates=[]
    def date_identify():
        ddates=df.Date.tolist()
        Sdate=pd.Series([3,6,9,12],index=['Mar','Jui','Sep','Déc'])
        month=[];year=[];days_length=[]
        for i in ddates:#dd.Date.tolist():
            month.append(Sdate[i[0:3]])
            year.append(int(i[-4:]))

        days_length=[];date=[]
        for j in range(0,len(month)):
            days_length.append(calendar.monthrange(year[j],month[j])[1])
            date.append(datetime(year[j],month[j],days_length[j]).strftime('%Y-%m-%d'))

        return date
    df.Date=date_identify()
    
    return df

In [144]:
f_employ(filesList[1])

,Date,BICH,BNC,BPH,BUH,PROMOBK,SOCABK,SOCABL,SOGEBK,UNIBK,CAPITALBK,SOGEBL,BHD,CBNA,SCOTIA,TOTAL
6,1998-09-30,10,543,102,335,165,144,0,515,326,94,44,0,53,80,2411
8,1998-12-31,10,452,111,364,163,150,0,514,368,97,46,0,54,81,2591
10,1999-03-31,10,454,105,371,161,152,0,543,392,120,49,0,56,82,2670
12,1999-06-30,10,452,106,376,160,164,0,694,381,124,49,0,56,82,2654
14,1999-09-30,10,316,107,383,164,177,0,750,412,157,48,0,51,84,2659
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
160,2017-12-31,0,806,133,246,NaN,NaN,NaN,1425,1314,686,72,0,31,0,4713
162,2018-03-31,0,806,133,245,NaN,NaN,NaN,1460,1322,707,73,0,31,0,4777
164,2018-06-30,0,801,132,273,NaN,NaN,NaN,1450,1315,716,74,0,30,0,4791
166,2018-09-30,0,787,127,278,NaN,NaN,NaN,1427,1287,774,74,0,32,0,4786
168,2018-12-31,0,783,123,351,NaN,NaN,NaN,1407,1272,754,74,0,31,0,4795

In [88]:
def group_data(x):
    df=f_employ(x)
    dfs=df.columns[1:] # list of columns, except the dates
    date=[];values=[];banks=[]
    for d in range(0,len(dfs)):
        date.append(df.Date)
        values.append((df[dfs[d]]))
        banks.append([dfs[d]]*df.shape[0])
    def flatten_list(x): # function to flatten a list of lists to 
        y=[]
        for i in x:
            for j in i:
                y.append(j)
        return y
    date=flatten_list(date)
    values=flatten_list(values)
    banks=flatten_list(banks)
    df=pd.DataFrame({'Date':date,'Banks':banks,'Employees':values})
    return df
group_data('trim_1_2014.xls')

           Date  Banks Employees
0    1998-09-30   BICH        10
1    1998-12-31   BICH        10
2    1999-03-31   BICH        10
3    1999-06-30   BICH        10
4    1999-09-30   BICH        10
..          ...    ...       ...
925  2012-12-31  TOTAL      3906
926  2013-03-31  TOTAL      3872
927  2013-06-30  TOTAL      3926
928  2013-09-30  TOTAL      3988
929  2013-12-31  TOTAL      4012

[930 rows x 3 columns]

In [118]:
group_data('trim_4_2019.xlsx')

           Date  Banks  Employees
0    2014-12-31    BNC        647
1    2015-03-31    BNC        638
2    2015-06-30    BNC        636
3    2015-09-30    BNC        623
4    2015-12-31    BNC        704
..          ...    ...        ...
195  2018-09-30  TOTAL       4786
196  2018-12-31  TOTAL       4795
197  2019-03-31  TOTAL       4745
198  2019-06-30  TOTAL       4776
199  2019-09-30  TOTAL       4793

[200 rows x 3 columns]

In [103]:
pd.concat([group_data('trim_1_2014.xls'),group_data('trim_1_2014.xls'),group_data('trim_1_2014.xls')],axis=0)

           Date  Banks Employees
0    1998-09-30   BICH        10
1    1998-12-31   BICH        10
2    1999-03-31   BICH        10
3    1999-06-30   BICH        10
4    1999-09-30   BICH        10
..          ...    ...       ...
925  2012-12-31  TOTAL      3906
926  2013-03-31  TOTAL      3872
927  2013-06-30  TOTAL      3926
928  2013-09-30  TOTAL      3988
929  2013-12-31  TOTAL      4012

[2790 rows x 3 columns]

In [104]:
df_files=pd.read_csv('BRH_ExcelFiles.csv')
filesList=df_files.x.tolist()

In [121]:
dodo=group_data(filesList[1])
#filesList[1]

In [122]:

for file in filesList[2:]:
    dodo.append(group_data(file))

In [141]:
def f_combine(x,f): # x is the list of files names; f is the function to apply
    df=f(x[1])
    for file in x[2:6]:
        df.append(f(file))
    return df

In [142]:
base_employees=f_combine(filesList,group_data)

In [154]:
# Verify files with dates problem to be corrected
def bugDates(x): # function to import and clean data
    df=pd.read_excel(x,sheet_name='employés')
    #date=[];ddates=[]
    def col_names(df): # look for the number of line with the names of the banks to be columns names
        y=[];z=[];
        for i in range(0,(df.shape[0]-1)):
            if 'BNC' in df.loc[i:(i+1),:].values:
                y=df.loc[i:(i+1),:].values.tolist()[0]
                z=i+1
                #break
        # add Date as name of column with the dates
        df.columns=['Date']+y[1:]#df_employ.columns[1:].tolist()
        df=df.iloc[z:,:]
        return df
    df=col_names(df)

    # remove columns where names are NaN
    jj=[ type(i)!=float for i in df.columns.values]
    df=df[df.columns.values[jj]]
    # remove all rows where there is at least 10 NaN
    df=df.dropna(axis=0,thresh=10)
    ###############
    date=[];ddates=[]
    def date_identify():
        ddates=df.Date.tolist()
        Sdate=pd.Series([3,6,9,12],index=['Mar','Jui','Sep','Déc'])
        month=[];year=[];days_length=[]
        for i in ddates:#dd.Date.tolist():
            month.append(Sdate[i[0:3]])
            year.append(int(i[-4:]))

        days_length=[];date=[]
        for j in range(0,len(month)):
            days_length.append(calendar.monthrange(year[j],month[j])[1])
            date.append(datetime(year[j],month[j],days_length[j]).strftime('%Y-%m-%d'))

        return date
    d=date_identify()
    return d
bugDates('trim_1_2022.xls')

['2014-12-31',
 '2015-03-31',
 '2015-06-30',
 '2015-09-30',
 '2015-12-31',
 '2016-03-31',
 '2016-06-30',
 '2016-09-30',
 '2016-12-31',
 '2017-03-31',
 '2017-06-30',
 '2017-09-30',
 '2017-12-31',
 '2018-03-31',
 '2018-06-30',
 '2018-09-30',
 '2018-12-31',
 '2019-03-31',
 '2019-06-30',
 '2019-09-30',
 '2019-12-31',
 '2020-03-31',
 '2020-06-30',
 '2020-09-30',
 '2020-12-31',
 '2021-03-31',
 '2021-06-30',
 '2021-09-30',
 '2021-12-31']

In [156]:
bugDates(filesList[0])

TypeError: 'datetime.datetime' object is not subscriptable